RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_ebi.h
/* Bit fields for EBI TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_RESETVALUE               0x00000000UL                                     /**< Default value for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_MASK                     0x00000307UL                                     /**< Mask for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_SHIFT       0                                                /**< Shift value for EBI_PIXEL0FORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_MASK        0x7UL                                            /**< Bit mask for EBI_PIXEL0FORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_DEFAULT     0x00000000UL                                     /**< Mode DEFAULT for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0555    0x00000000UL                                     /**< Mode ARGB0555 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0565    0x00000001UL                                     /**< Mode ARGB0565 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0666    0x00000002UL                                     /**< Mode ARGB0666 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0888    0x00000003UL                                     /**< Mode ARGB0888 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB5555    0x00000004UL                                     /**< Mode ARGB5555 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB6565    0x00000005UL                                     /**< Mode ARGB6565 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB6666    0x00000006UL                                     /**< Mode ARGB6666 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB8888    0x00000007UL                                     /**< Mode ARGB8888 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL0FORMAT_DEFAULT      (_EBI_TFTCOLORFORMAT_PIXEL0FORMAT_DEFAULT << 0)  /**< Shifted mode DEFAULT for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0555     (_EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0555 << 0) /**< Shifted mode ARGB0555 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0565     (_EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0565 << 0) /**< Shifted mode ARGB0565 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0666     (_EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0666 << 0) /**< Shifted mode ARGB0666 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0888     (_EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB0888 << 0) /**< Shifted mode ARGB0888 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB5555     (_EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB5555 << 0) /**< Shifted mode ARGB5555 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB6565     (_EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB6565 << 0) /**< Shifted mode ARGB6565 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB6666     (_EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB6666 << 0) /**< Shifted mode ARGB6666 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB8888     (_EBI_TFTCOLORFORMAT_PIXEL0FORMAT_ARGB8888 << 0) /**< Shifted mode ARGB8888 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL1FORMAT_SHIFT       8                                                /**< Shift value for EBI_PIXEL1FORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL1FORMAT_MASK        0x300UL                                          /**< Bit mask for EBI_PIXEL1FORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL1FORMAT_DEFAULT     0x00000000UL                                     /**< Mode DEFAULT for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB555      0x00000000UL                                     /**< Mode RGB555 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB565      0x00000001UL                                     /**< Mode RGB565 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB666      0x00000002UL                                     /**< Mode RGB666 for EBI_TFTCOLORFORMAT */
#define _EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB888      0x00000003UL                                     /**< Mode RGB888 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL1FORMAT_DEFAULT      (_EBI_TFTCOLORFORMAT_PIXEL1FORMAT_DEFAULT << 8)  /**< Shifted mode DEFAULT for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB555       (_EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB555 << 8)   /**< Shifted mode RGB555 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB565       (_EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB565 << 8)   /**< Shifted mode RGB565 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB666       (_EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB666 << 8)   /**< Shifted mode RGB666 for EBI_TFTCOLORFORMAT */
#define EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB888       (_EBI_TFTCOLORFORMAT_PIXEL1FORMAT_RGB888 << 8)   /**< Shifted mode RGB888 for EBI_TFTCOLORFORMAT */

/* Bit fields for EBI TFTFRAMEBASE */
#define _EBI_TFTFRAMEBASE_RESETVALUE                 0x00000000UL                               /**< Default value for EBI_TFTFRAMEBASE */
#define _EBI_TFTFRAMEBASE_MASK                       0x0FFFFFFFUL                               /**< Mask for EBI_TFTFRAMEBASE */
#define _EBI_TFTFRAMEBASE_FRAMEBASE_SHIFT            0                                          /**< Shift value for EBI_FRAMEBASE */
#define _EBI_TFTFRAMEBASE_FRAMEBASE_MASK             0xFFFFFFFUL                                /**< Bit mask for EBI_FRAMEBASE */
#define _EBI_TFTFRAMEBASE_FRAMEBASE_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for EBI_TFTFRAMEBASE */
#define EBI_TFTFRAMEBASE_FRAMEBASE_DEFAULT           (_EBI_TFTFRAMEBASE_FRAMEBASE_DEFAULT << 0) /**< Shifted mode DEFAULT for EBI_TFTFRAMEBASE */

/* Bit fields for EBI TFTSTRIDE */
#define _EBI_TFTSTRIDE_RESETVALUE                    0x00000000UL                          /**< Default value for EBI_TFTSTRIDE */
#define _EBI_TFTSTRIDE_MASK                          0x00000FFFUL                          /**< Mask for EBI_TFTSTRIDE */
#define _EBI_TFTSTRIDE_HSTRIDE_SHIFT                 0                                     /**< Shift value for EBI_HSTRIDE */
#define _EBI_TFTSTRIDE_HSTRIDE_MASK                  0xFFFUL                               /**< Bit mask for EBI_HSTRIDE */
#define _EBI_TFTSTRIDE_HSTRIDE_DEFAULT               0x00000000UL                          /**< Mode DEFAULT for EBI_TFTSTRIDE */
#define EBI_TFTSTRIDE_HSTRIDE_DEFAULT                (_EBI_TFTSTRIDE_HSTRIDE_DEFAULT << 0) /**< Shifted mode DEFAULT for EBI_TFTSTRIDE */

/* Bit fields for EBI TFTSIZE */
#define _EBI_TFTSIZE_RESETVALUE                      0x00000000UL                     /**< Default value for EBI_TFTSIZE */
#define _EBI_TFTSIZE_MASK                            0x03FF03FFUL                     /**< Mask for EBI_TFTSIZE */
#define _EBI_TFTSIZE_HSZ_SHIFT                       0                                /**< Shift value for EBI_HSZ */
#define _EBI_TFTSIZE_HSZ_MASK                        0x3FFUL                          /**< Bit mask for EBI_HSZ */
#define _EBI_TFTSIZE_HSZ_DEFAULT                     0x00000000UL                     /**< Mode DEFAULT for EBI_TFTSIZE */
#define EBI_TFTSIZE_HSZ_DEFAULT                      (_EBI_TFTSIZE_HSZ_DEFAULT << 0)  /**< Shifted mode DEFAULT for EBI_TFTSIZE */
#define _EBI_TFTSIZE_VSZ_SHIFT                       16                               /**< Shift value for EBI_VSZ */
#define _EBI_TFTSIZE_VSZ_MASK                        0x3FF0000UL                      /**< Bit mask for EBI_VSZ */
#define _EBI_TFTSIZE_VSZ_DEFAULT                     0x00000000UL                     /**< Mode DEFAULT for EBI_TFTSIZE */
#define EBI_TFTSIZE_VSZ_DEFAULT                      (_EBI_TFTSIZE_VSZ_DEFAULT << 16) /**< Shifted mode DEFAULT for EBI_TFTSIZE */

/* Bit fields for EBI TFTHPORCH */
#define _EBI_TFTHPORCH_RESETVALUE                    0x00000000UL                              /**< Default value for EBI_TFTHPORCH */
#define _EBI_TFTHPORCH_MASK                          0x33FCFF7FUL                              /**< Mask for EBI_TFTHPORCH */
#define _EBI_TFTHPORCH_HSYNC_SHIFT                   0                                         /**< Shift value for EBI_HSYNC */
#define _EBI_TFTHPORCH_HSYNC_MASK                    0x7FUL                                    /**< Bit mask for EBI_HSYNC */
#define _EBI_TFTHPORCH_HSYNC_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for EBI_TFTHPORCH */
#define EBI_TFTHPORCH_HSYNC_DEFAULT                  (_EBI_TFTHPORCH_HSYNC_DEFAULT << 0)       /**< Shifted mode DEFAULT for EBI_TFTHPORCH */
#define _EBI_TFTHPORCH_HFPORCH_SHIFT                 8                                         /**< Shift value for EBI_HFPORCH */
#define _EBI_TFTHPORCH_HFPORCH_MASK                  0xFF00UL                                  /**< Bit mask for EBI_HFPORCH */
#define _EBI_TFTHPORCH_HFPORCH_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for EBI_TFTHPORCH */
#define EBI_TFTHPORCH_HFPORCH_DEFAULT                (_EBI_TFTHPORCH_HFPORCH_DEFAULT << 8)     /**< Shifted mode DEFAULT for EBI_TFTHPORCH */
#define _EBI_TFTHPORCH_HBPORCH_SHIFT                 18                                        /**< Shift value for EBI_HBPORCH */
#define _EBI_TFTHPORCH_HBPORCH_MASK                  0x3FC0000UL                               /**< Bit mask for EBI_HBPORCH */
#define _EBI_TFTHPORCH_HBPORCH_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for EBI_TFTHPORCH */
#define EBI_TFTHPORCH_HBPORCH_DEFAULT                (_EBI_TFTHPORCH_HBPORCH_DEFAULT << 18)    /**< Shifted mode DEFAULT for EBI_TFTHPORCH */
#define _EBI_TFTHPORCH_HSYNCSTART_SHIFT              28                                        /**< Shift value for EBI_HSYNCSTART */
#define _EBI_TFTHPORCH_HSYNCSTART_MASK               0x30000000UL                              /**< Bit mask for EBI_HSYNCSTART */
#define _EBI_TFTHPORCH_HSYNCSTART_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for EBI_TFTHPORCH */
#define EBI_TFTHPORCH_HSYNCSTART_DEFAULT             (_EBI_TFTHPORCH_HSYNCSTART_DEFAULT << 28) /**< Shifted mode DEFAULT for EBI_TFTHPORCH */

