RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_ebi.h
/* Bit fields for EBI IEN */
#define _EBI_IEN_RESETVALUE                          0x00000000UL                           /**< Default value for EBI_IEN */
#define _EBI_IEN_MASK                                0x000003FFUL                           /**< Mask for EBI_IEN */
#define EBI_IEN_VSYNC                                (0x1UL << 0)                           /**< Vertical Sync Interrupt Enable */
#define _EBI_IEN_VSYNC_SHIFT                         0                                      /**< Shift value for EBI_VSYNC */
#define _EBI_IEN_VSYNC_MASK                          0x1UL                                  /**< Bit mask for EBI_VSYNC */
#define _EBI_IEN_VSYNC_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_VSYNC_DEFAULT                        (_EBI_IEN_VSYNC_DEFAULT << 0)          /**< Shifted mode DEFAULT for EBI_IEN */
#define EBI_IEN_HSYNC                                (0x1UL << 1)                           /**< Horizontal Sync Interrupt Enable */
#define _EBI_IEN_HSYNC_SHIFT                         1                                      /**< Shift value for EBI_HSYNC */
#define _EBI_IEN_HSYNC_MASK                          0x2UL                                  /**< Bit mask for EBI_HSYNC */
#define _EBI_IEN_HSYNC_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_HSYNC_DEFAULT                        (_EBI_IEN_HSYNC_DEFAULT << 1)          /**< Shifted mode DEFAULT for EBI_IEN */
#define EBI_IEN_VBPORCH                              (0x1UL << 2)                           /**< Vertical Back Porch Interrupt Enable */
#define _EBI_IEN_VBPORCH_SHIFT                       2                                      /**< Shift value for EBI_VBPORCH */
#define _EBI_IEN_VBPORCH_MASK                        0x4UL                                  /**< Bit mask for EBI_VBPORCH */
#define _EBI_IEN_VBPORCH_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_VBPORCH_DEFAULT                      (_EBI_IEN_VBPORCH_DEFAULT << 2)        /**< Shifted mode DEFAULT for EBI_IEN */
#define EBI_IEN_VFPORCH                              (0x1UL << 3)                           /**< Vertical Front Porch Interrupt Enable */
#define _EBI_IEN_VFPORCH_SHIFT                       3                                      /**< Shift value for EBI_VFPORCH */
#define _EBI_IEN_VFPORCH_MASK                        0x8UL                                  /**< Bit mask for EBI_VFPORCH */
#define _EBI_IEN_VFPORCH_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_VFPORCH_DEFAULT                      (_EBI_IEN_VFPORCH_DEFAULT << 3)        /**< Shifted mode DEFAULT for EBI_IEN */
#define EBI_IEN_DDEMPTY                              (0x1UL << 4)                           /**< Direct Drive Data Empty Interrupt Enable */
#define _EBI_IEN_DDEMPTY_SHIFT                       4                                      /**< Shift value for EBI_DDEMPTY */
#define _EBI_IEN_DDEMPTY_MASK                        0x10UL                                 /**< Bit mask for EBI_DDEMPTY */
#define _EBI_IEN_DDEMPTY_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_DDEMPTY_DEFAULT                      (_EBI_IEN_DDEMPTY_DEFAULT << 4)        /**< Shifted mode DEFAULT for EBI_IEN */
#define EBI_IEN_DDJIT                                (0x1UL << 5)                           /**< Direct Drive Jitter Interrupt Enable */
#define _EBI_IEN_DDJIT_SHIFT                         5                                      /**< Shift value for EBI_DDJIT */
#define _EBI_IEN_DDJIT_MASK                          0x20UL                                 /**< Bit mask for EBI_DDJIT */
#define _EBI_IEN_DDJIT_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_DDJIT_DEFAULT                        (_EBI_IEN_DDJIT_DEFAULT << 5)          /**< Shifted mode DEFAULT for EBI_IEN */
#define EBI_IEN_TFTPIXEL0EMPTY                       (0x1UL << 6)                           /**< EBI_TFTPIXEL0 Empty Interrupt Enable */
#define _EBI_IEN_TFTPIXEL0EMPTY_SHIFT                6                                      /**< Shift value for EBI_TFTPIXEL0EMPTY */
#define _EBI_IEN_TFTPIXEL0EMPTY_MASK                 0x40UL                                 /**< Bit mask for EBI_TFTPIXEL0EMPTY */
#define _EBI_IEN_TFTPIXEL0EMPTY_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_TFTPIXEL0EMPTY_DEFAULT               (_EBI_IEN_TFTPIXEL0EMPTY_DEFAULT << 6) /**< Shifted mode DEFAULT for EBI_IEN */
#define EBI_IEN_TFTPIXEL1EMPTY                       (0x1UL << 7)                           /**< EBI_TFTPIXEL1 Empty Interrupt Enable */
#define _EBI_IEN_TFTPIXEL1EMPTY_SHIFT                7                                      /**< Shift value for EBI_TFTPIXEL1EMPTY */
#define _EBI_IEN_TFTPIXEL1EMPTY_MASK                 0x80UL                                 /**< Bit mask for EBI_TFTPIXEL1EMPTY */
#define _EBI_IEN_TFTPIXEL1EMPTY_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_TFTPIXEL1EMPTY_DEFAULT               (_EBI_IEN_TFTPIXEL1EMPTY_DEFAULT << 7) /**< Shifted mode DEFAULT for EBI_IEN */
#define EBI_IEN_TFTPIXELFULL                         (0x1UL << 8)                           /**< EBI_TFTPIXEL Full Interrupt Enable */
#define _EBI_IEN_TFTPIXELFULL_SHIFT                  8                                      /**< Shift value for EBI_TFTPIXELFULL */
#define _EBI_IEN_TFTPIXELFULL_MASK                   0x100UL                                /**< Bit mask for EBI_TFTPIXELFULL */
#define _EBI_IEN_TFTPIXELFULL_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_TFTPIXELFULL_DEFAULT                 (_EBI_IEN_TFTPIXELFULL_DEFAULT << 8)   /**< Shifted mode DEFAULT for EBI_IEN */
#define EBI_IEN_TFTPIXELOF                           (0x1UL << 9)                           /**< EBI_TFTPIXEL Overflow Interrupt Enable */
#define _EBI_IEN_TFTPIXELOF_SHIFT                    9                                      /**< Shift value for EBI_TFTPIXELOF */
#define _EBI_IEN_TFTPIXELOF_MASK                     0x200UL                                /**< Bit mask for EBI_TFTPIXELOF */
#define _EBI_IEN_TFTPIXELOF_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for EBI_IEN */
#define EBI_IEN_TFTPIXELOF_DEFAULT                   (_EBI_IEN_TFTPIXELOF_DEFAULT << 9)     /**< Shifted mode DEFAULT for EBI_IEN */

/* Bit fields for EBI ROUTEPEN */
#define _EBI_ROUTEPEN_RESETVALUE                     0x00000000UL                            /**< Default value for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_MASK                           0x077F10FFUL                            /**< Mask for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_EBIPEN                          (0x1UL << 0)                            /**< EBI Pin Enable */
#define _EBI_ROUTEPEN_EBIPEN_SHIFT                   0                                       /**< Shift value for EBI_EBIPEN */
#define _EBI_ROUTEPEN_EBIPEN_MASK                    0x1UL                                   /**< Bit mask for EBI_EBIPEN */
#define _EBI_ROUTEPEN_EBIPEN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_EBIPEN_DEFAULT                  (_EBI_ROUTEPEN_EBIPEN_DEFAULT << 0)     /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CS0PEN                          (0x1UL << 1)                            /**< EBI_CS0 Pin Enable */
#define _EBI_ROUTEPEN_CS0PEN_SHIFT                   1                                       /**< Shift value for EBI_CS0PEN */
#define _EBI_ROUTEPEN_CS0PEN_MASK                    0x2UL                                   /**< Bit mask for EBI_CS0PEN */
#define _EBI_ROUTEPEN_CS0PEN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CS0PEN_DEFAULT                  (_EBI_ROUTEPEN_CS0PEN_DEFAULT << 1)     /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CS1PEN                          (0x1UL << 2)                            /**< EBI_CS1 Pin Enable */
#define _EBI_ROUTEPEN_CS1PEN_SHIFT                   2                                       /**< Shift value for EBI_CS1PEN */
#define _EBI_ROUTEPEN_CS1PEN_MASK                    0x4UL                                   /**< Bit mask for EBI_CS1PEN */
#define _EBI_ROUTEPEN_CS1PEN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CS1PEN_DEFAULT                  (_EBI_ROUTEPEN_CS1PEN_DEFAULT << 2)     /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CS2PEN                          (0x1UL << 3)                            /**< EBI_CS2 Pin Enable */
#define _EBI_ROUTEPEN_CS2PEN_SHIFT                   3                                       /**< Shift value for EBI_CS2PEN */
#define _EBI_ROUTEPEN_CS2PEN_MASK                    0x8UL                                   /**< Bit mask for EBI_CS2PEN */
#define _EBI_ROUTEPEN_CS2PEN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CS2PEN_DEFAULT                  (_EBI_ROUTEPEN_CS2PEN_DEFAULT << 3)     /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CS3PEN                          (0x1UL << 4)                            /**< EBI_CS3 Pin Enable */
#define _EBI_ROUTEPEN_CS3PEN_SHIFT                   4                                       /**< Shift value for EBI_CS3PEN */
#define _EBI_ROUTEPEN_CS3PEN_MASK                    0x10UL                                  /**< Bit mask for EBI_CS3PEN */
#define _EBI_ROUTEPEN_CS3PEN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CS3PEN_DEFAULT                  (_EBI_ROUTEPEN_CS3PEN_DEFAULT << 4)     /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_ALEPEN                          (0x1UL << 5)                            /**< EBI_ALE Pin Enable */
#define _EBI_ROUTEPEN_ALEPEN_SHIFT                   5                                       /**< Shift value for EBI_ALEPEN */
#define _EBI_ROUTEPEN_ALEPEN_MASK                    0x20UL                                  /**< Bit mask for EBI_ALEPEN */
#define _EBI_ROUTEPEN_ALEPEN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_ALEPEN_DEFAULT                  (_EBI_ROUTEPEN_ALEPEN_DEFAULT << 5)     /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_ARDYPEN                         (0x1UL << 6)                            /**< EBI_ARDY Pin Enable */
#define _EBI_ROUTEPEN_ARDYPEN_SHIFT                  6                                       /**< Shift value for EBI_ARDYPEN */
#define _EBI_ROUTEPEN_ARDYPEN_MASK                   0x40UL                                  /**< Bit mask for EBI_ARDYPEN */
#define _EBI_ROUTEPEN_ARDYPEN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_ARDYPEN_DEFAULT                 (_EBI_ROUTEPEN_ARDYPEN_DEFAULT << 6)    /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_BLPEN                           (0x1UL << 7)                            /**< EBI_BL[1:0] Pin Enable */
#define _EBI_ROUTEPEN_BLPEN_SHIFT                    7                                       /**< Shift value for EBI_BLPEN */
#define _EBI_ROUTEPEN_BLPEN_MASK                     0x80UL                                  /**< Bit mask for EBI_BLPEN */
#define _EBI_ROUTEPEN_BLPEN_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_BLPEN_DEFAULT                   (_EBI_ROUTEPEN_BLPEN_DEFAULT << 7)      /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_NANDPEN                         (0x1UL << 12)                           /**< NANDRE and NANDWE Pin Enable */
#define _EBI_ROUTEPEN_NANDPEN_SHIFT                  12                                      /**< Shift value for EBI_NANDPEN */
#define _EBI_ROUTEPEN_NANDPEN_MASK                   0x1000UL                                /**< Bit mask for EBI_NANDPEN */
#define _EBI_ROUTEPEN_NANDPEN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_NANDPEN_DEFAULT                 (_EBI_ROUTEPEN_NANDPEN_DEFAULT << 12)   /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_ALB_SHIFT                      16                                      /**< Shift value for EBI_ALB */
#define _EBI_ROUTEPEN_ALB_MASK                       0x30000UL                               /**< Bit mask for EBI_ALB */
#define _EBI_ROUTEPEN_ALB_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_ALB_A0                         0x00000000UL                            /**< Mode A0 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_ALB_A8                         0x00000001UL                            /**< Mode A8 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_ALB_A16                        0x00000002UL                            /**< Mode A16 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_ALB_A24                        0x00000003UL                            /**< Mode A24 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_ALB_DEFAULT                     (_EBI_ROUTEPEN_ALB_DEFAULT << 16)       /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_ALB_A0                          (_EBI_ROUTEPEN_ALB_A0 << 16)            /**< Shifted mode A0 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_ALB_A8                          (_EBI_ROUTEPEN_ALB_A8 << 16)            /**< Shifted mode A8 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_ALB_A16                         (_EBI_ROUTEPEN_ALB_A16 << 16)           /**< Shifted mode A16 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_ALB_A24                         (_EBI_ROUTEPEN_ALB_A24 << 16)           /**< Shifted mode A24 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_SHIFT                     18                                      /**< Shift value for EBI_APEN */
#define _EBI_ROUTEPEN_APEN_MASK                      0x7C0000UL                              /**< Bit mask for EBI_APEN */
#define _EBI_ROUTEPEN_APEN_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A0                        0x00000000UL                            /**< Mode A0 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A5                        0x00000005UL                            /**< Mode A5 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A6                        0x00000006UL                            /**< Mode A6 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A7                        0x00000007UL                            /**< Mode A7 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A8                        0x00000008UL                            /**< Mode A8 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A9                        0x00000009UL                            /**< Mode A9 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A10                       0x0000000AUL                            /**< Mode A10 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A11                       0x0000000BUL                            /**< Mode A11 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A12                       0x0000000CUL                            /**< Mode A12 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A13                       0x0000000DUL                            /**< Mode A13 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A14                       0x0000000EUL                            /**< Mode A14 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A15                       0x0000000FUL                            /**< Mode A15 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A16                       0x00000010UL                            /**< Mode A16 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A17                       0x00000011UL                            /**< Mode A17 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A18                       0x00000012UL                            /**< Mode A18 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A19                       0x00000013UL                            /**< Mode A19 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A20                       0x00000014UL                            /**< Mode A20 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A21                       0x00000015UL                            /**< Mode A21 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A22                       0x00000016UL                            /**< Mode A22 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A23                       0x00000017UL                            /**< Mode A23 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A24                       0x00000018UL                            /**< Mode A24 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A25                       0x00000019UL                            /**< Mode A25 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A26                       0x0000001AUL                            /**< Mode A26 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A27                       0x0000001BUL                            /**< Mode A27 for EBI_ROUTEPEN */
#define _EBI_ROUTEPEN_APEN_A28                       0x0000001CUL                            /**< Mode A28 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_DEFAULT                    (_EBI_ROUTEPEN_APEN_DEFAULT << 18)      /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A0                         (_EBI_ROUTEPEN_APEN_A0 << 18)           /**< Shifted mode A0 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A5                         (_EBI_ROUTEPEN_APEN_A5 << 18)           /**< Shifted mode A5 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A6                         (_EBI_ROUTEPEN_APEN_A6 << 18)           /**< Shifted mode A6 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A7                         (_EBI_ROUTEPEN_APEN_A7 << 18)           /**< Shifted mode A7 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A8                         (_EBI_ROUTEPEN_APEN_A8 << 18)           /**< Shifted mode A8 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A9                         (_EBI_ROUTEPEN_APEN_A9 << 18)           /**< Shifted mode A9 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A10                        (_EBI_ROUTEPEN_APEN_A10 << 18)          /**< Shifted mode A10 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A11                        (_EBI_ROUTEPEN_APEN_A11 << 18)          /**< Shifted mode A11 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A12                        (_EBI_ROUTEPEN_APEN_A12 << 18)          /**< Shifted mode A12 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A13                        (_EBI_ROUTEPEN_APEN_A13 << 18)          /**< Shifted mode A13 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A14                        (_EBI_ROUTEPEN_APEN_A14 << 18)          /**< Shifted mode A14 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A15                        (_EBI_ROUTEPEN_APEN_A15 << 18)          /**< Shifted mode A15 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A16                        (_EBI_ROUTEPEN_APEN_A16 << 18)          /**< Shifted mode A16 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A17                        (_EBI_ROUTEPEN_APEN_A17 << 18)          /**< Shifted mode A17 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A18                        (_EBI_ROUTEPEN_APEN_A18 << 18)          /**< Shifted mode A18 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A19                        (_EBI_ROUTEPEN_APEN_A19 << 18)          /**< Shifted mode A19 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A20                        (_EBI_ROUTEPEN_APEN_A20 << 18)          /**< Shifted mode A20 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A21                        (_EBI_ROUTEPEN_APEN_A21 << 18)          /**< Shifted mode A21 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A22                        (_EBI_ROUTEPEN_APEN_A22 << 18)          /**< Shifted mode A22 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A23                        (_EBI_ROUTEPEN_APEN_A23 << 18)          /**< Shifted mode A23 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A24                        (_EBI_ROUTEPEN_APEN_A24 << 18)          /**< Shifted mode A24 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A25                        (_EBI_ROUTEPEN_APEN_A25 << 18)          /**< Shifted mode A25 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A26                        (_EBI_ROUTEPEN_APEN_A26 << 18)          /**< Shifted mode A26 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A27                        (_EBI_ROUTEPEN_APEN_A27 << 18)          /**< Shifted mode A27 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_APEN_A28                        (_EBI_ROUTEPEN_APEN_A28 << 18)          /**< Shifted mode A28 for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_TFTPEN                          (0x1UL << 24)                           /**< EBI_TFT Pin Enable */
#define _EBI_ROUTEPEN_TFTPEN_SHIFT                   24                                      /**< Shift value for EBI_TFTPEN */
#define _EBI_ROUTEPEN_TFTPEN_MASK                    0x1000000UL                             /**< Bit mask for EBI_TFTPEN */
#define _EBI_ROUTEPEN_TFTPEN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_TFTPEN_DEFAULT                  (_EBI_ROUTEPEN_TFTPEN_DEFAULT << 24)    /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_DATAENPEN                       (0x1UL << 25)                           /**< EBI_DATA Pin Enable */
#define _EBI_ROUTEPEN_DATAENPEN_SHIFT                25                                      /**< Shift value for EBI_DATAENPEN */
#define _EBI_ROUTEPEN_DATAENPEN_MASK                 0x2000000UL                             /**< Bit mask for EBI_DATAENPEN */
#define _EBI_ROUTEPEN_DATAENPEN_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_DATAENPEN_DEFAULT               (_EBI_ROUTEPEN_DATAENPEN_DEFAULT << 25) /**< Shifted mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CSTFTPEN                        (0x1UL << 26)                           /**< EBI_CSTFT Pin Enable */
#define _EBI_ROUTEPEN_CSTFTPEN_SHIFT                 26                                      /**< Shift value for EBI_CSTFTPEN */
#define _EBI_ROUTEPEN_CSTFTPEN_MASK                  0x4000000UL                             /**< Bit mask for EBI_CSTFTPEN */
#define _EBI_ROUTEPEN_CSTFTPEN_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EBI_ROUTEPEN */
#define EBI_ROUTEPEN_CSTFTPEN_DEFAULT                (_EBI_ROUTEPEN_CSTFTPEN_DEFAULT << 26)  /**< Shifted mode DEFAULT for EBI_ROUTEPEN */

