RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_ebi.h
/* Bit fields for EBI ROUTELOC0 */
#define _EBI_ROUTELOC0_RESETVALUE                    0x00000000UL                           /**< Default value for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_MASK                          0x03070707UL                           /**< Mask for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_EBILOC_SHIFT                  0                                      /**< Shift value for EBI_EBILOC */
#define _EBI_ROUTELOC0_EBILOC_MASK                   0x7UL                                  /**< Bit mask for EBI_EBILOC */
#define _EBI_ROUTELOC0_EBILOC_LOC0                   0x00000000UL                           /**< Mode LOC0 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_EBILOC_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_EBILOC_LOC1                   0x00000001UL                           /**< Mode LOC1 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_EBILOC_LOC2                   0x00000002UL                           /**< Mode LOC2 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_EBILOC_LOC3                   0x00000003UL                           /**< Mode LOC3 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_EBILOC_LOC4                   0x00000004UL                           /**< Mode LOC4 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_EBILOC_LOC5                   0x00000005UL                           /**< Mode LOC5 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_EBILOC_LOC0                    (_EBI_ROUTELOC0_EBILOC_LOC0 << 0)      /**< Shifted mode LOC0 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_EBILOC_DEFAULT                 (_EBI_ROUTELOC0_EBILOC_DEFAULT << 0)   /**< Shifted mode DEFAULT for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_EBILOC_LOC1                    (_EBI_ROUTELOC0_EBILOC_LOC1 << 0)      /**< Shifted mode LOC1 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_EBILOC_LOC2                    (_EBI_ROUTELOC0_EBILOC_LOC2 << 0)      /**< Shifted mode LOC2 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_EBILOC_LOC3                    (_EBI_ROUTELOC0_EBILOC_LOC3 << 0)      /**< Shifted mode LOC3 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_EBILOC_LOC4                    (_EBI_ROUTELOC0_EBILOC_LOC4 << 0)      /**< Shifted mode LOC4 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_EBILOC_LOC5                    (_EBI_ROUTELOC0_EBILOC_LOC5 << 0)      /**< Shifted mode LOC5 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_CSLOC_SHIFT                   8                                      /**< Shift value for EBI_CSLOC */
#define _EBI_ROUTELOC0_CSLOC_MASK                    0x700UL                                /**< Bit mask for EBI_CSLOC */
#define _EBI_ROUTELOC0_CSLOC_LOC0                    0x00000000UL                           /**< Mode LOC0 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_CSLOC_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_CSLOC_LOC1                    0x00000001UL                           /**< Mode LOC1 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_CSLOC_LOC2                    0x00000002UL                           /**< Mode LOC2 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_CSLOC_LOC3                    0x00000003UL                           /**< Mode LOC3 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_CSLOC_LOC4                    0x00000004UL                           /**< Mode LOC4 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_CSLOC_LOC0                     (_EBI_ROUTELOC0_CSLOC_LOC0 << 8)       /**< Shifted mode LOC0 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_CSLOC_DEFAULT                  (_EBI_ROUTELOC0_CSLOC_DEFAULT << 8)    /**< Shifted mode DEFAULT for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_CSLOC_LOC1                     (_EBI_ROUTELOC0_CSLOC_LOC1 << 8)       /**< Shifted mode LOC1 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_CSLOC_LOC2                     (_EBI_ROUTELOC0_CSLOC_LOC2 << 8)       /**< Shifted mode LOC2 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_CSLOC_LOC3                     (_EBI_ROUTELOC0_CSLOC_LOC3 << 8)       /**< Shifted mode LOC3 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_CSLOC_LOC4                     (_EBI_ROUTELOC0_CSLOC_LOC4 << 8)       /**< Shifted mode LOC4 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_NANDLOC_SHIFT                 16                                     /**< Shift value for EBI_NANDLOC */
#define _EBI_ROUTELOC0_NANDLOC_MASK                  0x70000UL                              /**< Bit mask for EBI_NANDLOC */
#define _EBI_ROUTELOC0_NANDLOC_LOC0                  0x00000000UL                           /**< Mode LOC0 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_NANDLOC_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_NANDLOC_LOC1                  0x00000001UL                           /**< Mode LOC1 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_NANDLOC_LOC2                  0x00000002UL                           /**< Mode LOC2 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_NANDLOC_LOC3                  0x00000003UL                           /**< Mode LOC3 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_NANDLOC_LOC4                  0x00000004UL                           /**< Mode LOC4 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_NANDLOC_LOC5                  0x00000005UL                           /**< Mode LOC5 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_NANDLOC_LOC0                   (_EBI_ROUTELOC0_NANDLOC_LOC0 << 16)    /**< Shifted mode LOC0 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_NANDLOC_DEFAULT                (_EBI_ROUTELOC0_NANDLOC_DEFAULT << 16) /**< Shifted mode DEFAULT for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_NANDLOC_LOC1                   (_EBI_ROUTELOC0_NANDLOC_LOC1 << 16)    /**< Shifted mode LOC1 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_NANDLOC_LOC2                   (_EBI_ROUTELOC0_NANDLOC_LOC2 << 16)    /**< Shifted mode LOC2 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_NANDLOC_LOC3                   (_EBI_ROUTELOC0_NANDLOC_LOC3 << 16)    /**< Shifted mode LOC3 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_NANDLOC_LOC4                   (_EBI_ROUTELOC0_NANDLOC_LOC4 << 16)    /**< Shifted mode LOC4 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_NANDLOC_LOC5                   (_EBI_ROUTELOC0_NANDLOC_LOC5 << 16)    /**< Shifted mode LOC5 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_TFTLOC_SHIFT                  24                                     /**< Shift value for EBI_TFTLOC */
#define _EBI_ROUTELOC0_TFTLOC_MASK                   0x3000000UL                            /**< Bit mask for EBI_TFTLOC */
#define _EBI_ROUTELOC0_TFTLOC_LOC0                   0x00000000UL                           /**< Mode LOC0 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_TFTLOC_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_TFTLOC_LOC1                   0x00000001UL                           /**< Mode LOC1 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_TFTLOC_LOC2                   0x00000002UL                           /**< Mode LOC2 for EBI_ROUTELOC0 */
#define _EBI_ROUTELOC0_TFTLOC_LOC3                   0x00000003UL                           /**< Mode LOC3 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_TFTLOC_LOC0                    (_EBI_ROUTELOC0_TFTLOC_LOC0 << 24)     /**< Shifted mode LOC0 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_TFTLOC_DEFAULT                 (_EBI_ROUTELOC0_TFTLOC_DEFAULT << 24)  /**< Shifted mode DEFAULT for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_TFTLOC_LOC1                    (_EBI_ROUTELOC0_TFTLOC_LOC1 << 24)     /**< Shifted mode LOC1 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_TFTLOC_LOC2                    (_EBI_ROUTELOC0_TFTLOC_LOC2 << 24)     /**< Shifted mode LOC2 for EBI_ROUTELOC0 */
#define EBI_ROUTELOC0_TFTLOC_LOC3                    (_EBI_ROUTELOC0_TFTLOC_LOC3 << 24)     /**< Shifted mode LOC3 for EBI_ROUTELOC0 */

